import libnum


# 进制转换器
def Converter():
    try:
        print('——————————————————————————————————————————————————————————————————————————————')
        print('选择了进制转换器')
        print('——————————————————————————————————————————————————————————————————————————————')
        s = int(input('选择需要转换的数据: 1.二进制 2.八进制 3.十进制 4.十六进制 5.二进制转字符串 6.十六进制转字符串:'))
        try:
            if s == 1:
                c = int(input('二进制数据为:'))
                print('——————————————————————————————————————————————————————————————————————————————')
                e = '{}{}'.format('0b', c)
                print('转换为八进制为:', oct(int(e, 2)))
                print('转换为十进制为:', int(e, 2))
                print('转换为十六进制为:', hex(int(e, 2)))
            if s == 2:
                c = int(input('八进制数据为:')) 
                print('——————————————————————————————————————————————————————————————————————————————')
                e = '{}{}'.format('0o', c)
                print('转换为二进制为:', bin(int(e, 8)))
                print('转换为十进制为:', int(e, 8))
                print('转换为十六进制为:', hex(int(e, 8)))
            if s == 3:
                c = int(input('十进制数据为:'))
                print('——————————————————————————————————————————————————————————————————————————————')
                print('转换为二进制为:', bin(int(c)))
                print('转换为八进制为:', oct(c))
                print('转换为十六进制为:', hex(c))
            if s == 4:
                c = input('十六进制数据为:')
                print('——————————————————————————————————————————————————————————————————————————————')
                e = '{}{}'.format('0x', c)
                print('转换为二进制为:', bin(int(e, 16)))
                print('转换为八进制为:', oct(int(e, 16)))
                print('转换为十进制为:', int(e, 16))
            if s == 5:
                c = input('待转换数据为:')
                print('——————————————————————————————————————————————————————————————————————————————')
                print(str((libnum.b2s(c))).strip('b\''))
            if s == 6:
                c = input('待转换数据为:')
                print('——————————————————————————————————————————————————————————————————————————————')
                e = '{}{}'.format('0x', c)
                print(str(libnum.n2s(int(e, 16))).strip("b'"))
        except:
            print('请输入正确的数据!')
    except:
        print('请选择正确的编号!')